org/memos.org
* コンピュータと数式処理

** 今日の話の流れ

   主に，ツールの話です。

   少しだけ，仕組みの話もします。

   - 自分と数学とコンピュータ

   - 数学ソフトウェア

     - スマホで使える数式処理

   - 数式処理システム 
     - sage入門
     - sage Links
     - octave / sage
     - latex / sage
     - graphics / sage

   - 数式処理とは
     - いいとこ悪いとこ
     - 数値計算を補う
     - 算法
       - グレブナー基底
       - (mod p) 因数分解と

   - Web進化論
     - 集合知
     - 知識の構造化

   - 思考とメモと文書のためのデジタル・ツール
     - 知識は構造
     - HyperLink
     - MindMapping
     - Outliner
     - markup
     - 文芸的プログラミング

   - 計算論的思考

     - computer科学者のように考え，問題に取り組み，システムをデザイン
       しよう
* 自己紹介

  - [[http://wiki.cis.iwate-u.ac.jp/~suzuki/][講義情報]] (~2016)

  - [[https://github.com/masayuki054/comp_and_cal/][講義資料のサイト]]

     
** 科学と数学，計算，コンピュータ

*** 自分と数理科学とコンピュータ

**** 物理学と数学のつながり 

     数理科学 [[http://www.saiensu.co.jp/preview/2017-4910054690576/201705.pdf][巻頭言201705.pdf]]

     [[http://www.saiensu.co.jp/?page=book_details&ISBN=4910054690576&YEAR=2017][株式会社サイエンス社 株式会社新世社 株式会社数理工学社]]

*** 数学ソフトウェア 

**** MathLibre

     DVD起動Linuxで，オープン・ソースで，フリーな数学ソフトウェアを収録

     - [[https://www.geogebra.org/m/hShSTr6e#material/eBgcxeXC][KNOPPIX/Math->MathLibre]] 

       Free Mathmatical Softwares on DVD-bootable Linux

     - [[https://www.geogebra.org/m/hShSTr6e#material/MEEJS9CK][数学ソフトウェア紹介 - GeoGebraBook]]

    1) ソフトウェア電卓  

       [[http://ja.numberempire.com/][数の帝国 - 数学ツール]] 数の帝国は、強力な数学ツールと数について
       の知識のコレクションです。
       
    2) 数式処理システム

       [[https://ja.wikipedia.org/wiki/Sage_(%E6%95%B0%E5%BC%8F%E5%87%A6%E7%90%86%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0)][Sage (数式処理システム) - Wikipedia]]

    3) 統計学
    4) 最適化ソフトウェア
    5) 幾何学ソフトウェア
    6) 数値解析

       [[https://matome.naver.jp/odai/2136163231573327601][MATLABの代わりに使えるソフトウェアまとめ- NAVER まとめ]]

** Sage
**** [[https://www.math.nagoya-u.ac.jp/~naito/lecture/2012_SS.calc/software-1.pdf][数学ソフトウェアの使い方]] 名古屋大学医学部 数学通論I 
     - mathematic, sage の概要
     - Sageの簡単な利用法

**** [[http://www.pwv.co.jp/~take/TakeWiki/index.php?sage%2Fsage%E3%81%AE%E7%B4%B9%E4%BB%8B ][sage/sageの紹介 - PukiWiki]]

*** [[http://www.wolframalpha.com/][Wolfram|Alpha: Computational Knowledge Engine]]


** 数式処理アルゴリズム

*** 奈良女子大で話した Groebner_basis の話

    [[file:/NFS/ufs/mac/masayuki/BSD/Cal/nara-wu/gbasis.tex]]

*** 不定積分入門			      :algorithm:risch:integral:math:
    [[http://www-sop.inria.fr/cafe/Manuel.Bronstein/publications/issac98.pdf][symbolic integration tutorial--issac98.pdf]]

    wikipedia の参考文献にあった

    [2017-10-03 火 16:54]

** Web 進化論/知の構造化 

   http://wiki.cis.iwate-u.ac.jp/~suzuki/web_revolution/

** 情報科学 の立場から

*** 情報科学の本質 抽象化のための手続き		

    [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/commons/abstraction.html][抽象化のための手続き]]


*** 情報科学のための数学

**** プログラム可能な証明

**** 機械証明 -- 証明から計算へ

*** 思考とメモと文書作成のためのデジタル・ツール

**** MindMapping

**** outliner 

    [[./outline-reading-writing.org]]

***** emacs org - アウトライナー

****** Org Babelで文芸的プログラミング · ops●tokyo

     [[http://wallyqs.github.io/posts/2014/12/12/using-org-babel-for-lp-jp/][Org Babelで文芸的プログラミング · ops●tokyo]]
     素晴しい!

**** LaTeX tikz

**** markup 
     - simplenote
     - Emacs org-mode

**** HyperLink
     - HTML origin
* コンピュータと数式処理のリンク集

** sage 

    [[https://cocalc.com/projects?session=default][Projects - CoCalc]]

    [[http://sagecell.sagemath.org/][Sage Cell Server]]

    - [[http://doc.sagemath.org/pdf/ja/tutorial/tutorial-jp.pdf][Sage tutorial-jp.pdf]]

    [[http://www.pwv.co.jp/%7Etake/TakeWiki/index.php?sage%2Fsage%E3%81%AE%E7%B4%B9%E4%BB%8B][sage/sageの紹介 - PukiWiki]] たけもとさん

    - [[http://www.pwv.co.jp/~take/TakeWiki/index.php?sage%2F%E8%A8%88%E7%AE%97%E3%81%97%E3%81%A6%E3%81%BF%E3%82%88%E3%81%86][sage/計算してみよう - PukiWiki]]

    - [[http://www.pwv.co.jp/%7Etake/TakeWiki/index.php?sage%2FSage%E3%81%A7Octave%E3%82%92%E4%BD%BF%E3%81%86][sage/SageでOctaveを使う - PukiWiki]] 

** SageLink

   [[http://sagemath.org]] 

   [[http://sk.sagepub.com/reference][SAGE Knowledge - Reference]] reference の検索

   [[https://qiita.com/HirofumiYashima/items/6bb5770961a3b7d33118][Sageに関するリンク集]]

   [[http://www.gregorybard.com/Sage.html][Sage for undergraduates, free pdf]]   このページ内に pdf へのリンクが
   ある

* 数式処理アルゴリズム

*** 不定積分入門			      :algorithm:risch:integral:math:
    [[http://www-sop.inria.fr/cafe/Manuel.Bronstein/publications/issac98.pdf][symbolic integration tutorial--issac98.pdf]]
    
*** Greobner基底に関するページ

    - [[https://www.slideshare.net/konn/grbner][技術者が知るべき Gröbner 基底]]
    
    - [[http://sssslide.com/speakerdeck.com/konn/wakatutatumorininaru-grobner-ji-di][わかったつもりになる Gröbner 基底 - SSSSLIDE]]
    
    - [[http://konn-san.com/math/computational-algebra-seminar.html][計算機代数ゼミ発表資料 - konn-san.com]]
    
    - [[https://github.com/konn/computational-algebra][konn/computational-algebra: Library to calculate Gröbner basis written in Haskell.]]

* Web 進化論/知の構造化 

    「知識」について考え直す時なのでは？

**** [[http://ocw.u-tokyo.ac.jp/lecture_files/gf_18/1/notes/ja/01yoshimimima.pdf][今，学問，大学，知識，について，何が起っているのか？]]

    - 知の細分化と閉塞、全体を視る目の喪失

    - 知識は「みんな」で作るものだという発想

    - 構造性：要素を相互に結びつける構造こそ知識

    - ネット検索で瞬時にして必要な情報を次々に手に入れることで、緩やか
      に形成される知識を失っているのかもしれない？

    - 学術俯瞰とタテとヨコをつなぐ学び，
      新しいリベラルアーツと専門知の結合


