docs/memos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"https://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="https://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-13 火 10:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="m" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org729e30d">1. コンピュータと数式処理</a>
<ul>
<li><a href="#org251d337">1.1. 今日の話の流れ</a></li>
</ul>
</li>
<li><a href="#org9d48229">2. 自己紹介</a>
<ul>
<li><a href="#orgb8c88b5">2.1. 科学と数学，計算，コンピュータ</a>
<ul>
<li><a href="#org3a47724">2.1.1. 自分と数理科学とコンピュータ</a></li>
<li><a href="#orge5f150c">2.1.2. 数学ソフトウェア</a></li>
</ul>
</li>
<li><a href="#orgf715f3a">2.2. Sage</a>
<ul>
<li><a href="#orga0eb54c">2.2.1. Wolfram|Alpha: Computational Knowledge Engine</a></li>
</ul>
</li>
<li><a href="#org66758bb">2.3. 数式処理アルゴリズム</a>
<ul>
<li><a href="#org9200873">2.3.1. 奈良女子大で話した Groebner<sub>basis</sub> の話</a></li>
<li><a href="#org7672b6c">2.3.2. 不定積分入門&#xa0;&#xa0;&#xa0;<span class="tag"><span class="algorithm">algorithm</span>&#xa0;<span class="risch">risch</span>&#xa0;<span class="integral">integral</span>&#xa0;<span class="math">math</span></span></a></li>
</ul>
</li>
<li><a href="#org7559aec">2.4. Web 進化論/知の構造化</a></li>
<li><a href="#orgfe22b69">2.5. 情報科学 の立場から</a>
<ul>
<li><a href="#orge27af26">2.5.1. 情報科学の本質 抽象化のための手続き</a></li>
<li><a href="#org07ccdf6">2.5.2. 情報科学のための数学</a></li>
<li><a href="#org31973a7">2.5.3. 思考とメモと文書作成のためのデジタル・ツール</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org781eed2">3. コンピュータと数式処理のリンク集</a>
<ul>
<li><a href="#org86dcffa">3.1. sage</a></li>
<li><a href="#org46ca4ba">3.2. SageLink</a></li>
</ul>
</li>
<li><a href="#org96c8d74">4. 数式処理アルゴリズム</a>
<ul>
<li>
<ul>
<li><a href="#org8b07038">4.0.1. 不定積分入門&#xa0;&#xa0;&#xa0;<span class="tag"><span class="algorithm">algorithm</span>&#xa0;<span class="risch">risch</span>&#xa0;<span class="integral">integral</span>&#xa0;<span class="math">math</span></span></a></li>
<li><a href="#orgc16ce31">4.0.2. Greobner基底に関するページ</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaf91040">5. Web 進化論/知の構造化</a></li>
</ul>
</div>
</div>
<div id="outline-container-org729e30d" class="outline-2">
<h2 id="org729e30d"><span class="section-number-2">1</span> コンピュータと数式処理</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org251d337" class="outline-3">
<h3 id="org251d337"><span class="section-number-3">1.1</span> 今日の話の流れ</h3>
<div class="outline-text-3" id="text-1-1">
<p>
主に，ツールの話です。
</p>

<p>
少しだけ，仕組みの話もします。
</p>

<ul class="org-ul">
<li>自分と数学とコンピュータ</li>

<li>数学ソフトウェア

<ul class="org-ul">
<li>スマホで使える数式処理</li>
</ul></li>

<li>数式処理システム 
<ul class="org-ul">
<li>sage入門</li>
<li>sage Links</li>
<li>octave / sage</li>
<li>latex / sage</li>
<li>graphics / sage</li>
</ul></li>

<li>数式処理とは
<ul class="org-ul">
<li>いいとこ悪いとこ</li>
<li>数値計算を補う</li>
<li>算法
<ul class="org-ul">
<li>グレブナー基底</li>
<li>(mod p) 因数分解と</li>
</ul></li>
</ul></li>

<li>Web進化論
<ul class="org-ul">
<li>集合知</li>
<li>知識の構造化</li>
</ul></li>

<li>思考とメモと文書のためのデジタル・ツール
<ul class="org-ul">
<li>知識は構造</li>
<li>HyperLink</li>
<li>MindMapping</li>
<li>Outliner</li>
<li>markup</li>
<li>文芸的プログラミング</li>
</ul></li>

<li>計算論的思考

<ul class="org-ul">
<li>computer科学者のように考え，問題に取り組み，システムをデザイン
しよう</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9d48229" class="outline-2">
<h2 id="org9d48229"><span class="section-number-2">2</span> 自己紹介</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://wiki.cis.iwate-u.ac.jp/~suzuki/">講義情報</a> (~2016)</li>

<li><a href="https://github.com/masayuki054/comp_and_cal/">講義資料のサイト</a></li>
</ul>
</div>


<div id="outline-container-orgb8c88b5" class="outline-3">
<h3 id="orgb8c88b5"><span class="section-number-3">2.1</span> 科学と数学，計算，コンピュータ</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org3a47724" class="outline-4">
<h4 id="org3a47724"><span class="section-number-4">2.1.1</span> 自分と数理科学とコンピュータ</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="org08822fc"></a>物理学と数学のつながり<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
数理科学 <a href="https://www.saiensu.co.jp/preview/2017-4910054690576/201705.pdf">巻頭言201705.pdf</a>
</p>

<p>
<a href="https://www.saiensu.co.jp/?page=book_details&amp;ISBN=4910054690576&amp;YEAR=2017">株式会社サイエンス社 株式会社新世社 株式会社数理工学社</a>
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge5f150c" class="outline-4">
<h4 id="orge5f150c"><span class="section-number-4">2.1.2</span> 数学ソフトウェア</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ol class="org-ol">
<li><a id="orgb94fe7e"></a>MathLibre<br />
<div class="outline-text-5" id="text-2-1-2-1">
<p>
DVD起動Linuxで，オープン・ソースで，フリーな数学ソフトウェアを収録
</p>

<ul class="org-ul">
<li><p>
<a href="https://www.geogebra.org/m/hShSTr6e#material/eBgcxeXC">KNOPPIX/Math-&gt;MathLibre</a> 
</p>

<p>
Free Mathmatical Softwares on DVD-bootable Linux
</p></li>

<li><a href="https://www.geogebra.org/m/hShSTr6e#material/MEEJS9CK">数学ソフトウェア紹介 - GeoGebraBook</a></li>
</ul>
<ol class="org-ol">
<li><p>
ソフトウェア電卓  
</p>

<p>
<a href="https://ja.numberempire.com/">数の帝国 - 数学ツール</a> 数の帝国は、強力な数学ツールと数について
の知識のコレクションです。
</p></li>

<li><p>
数式処理システム
</p>

<p>
<a href="https://ja.wikipedia.org/wiki/Sage_(%E6%95%B0%E5%BC%8F%E5%87%A6%E7%90%86%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0)">Sage (数式処理システム) - Wikipedia</a>
</p></li>

<li>統計学</li>
<li>最適化ソフトウェア</li>
<li>幾何学ソフトウェア</li>
<li><p>
数値解析
</p>

<p>
<a href="https://matome.naver.jp/odai/2136163231573327601">MATLABの代わりに使えるソフトウェアまとめ- NAVER まとめ</a>
</p></li>
</ol>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgf715f3a" class="outline-3">
<h3 id="orgf715f3a"><span class="section-number-3">2.2</span> Sage</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<ol class="org-ol">
<li><a id="org49642b8"></a><a href="https://www.math.nagoya-u.ac.jp/~naito/lecture/2012_SS.calc/software-1.pdf">数学ソフトウェアの使い方</a> 名古屋大学医学部 数学通論I<br />
<div class="outline-text-5" id="text-2-2-0-1">
<ul class="org-ul">
<li>mathematic, sage の概要</li>
<li>Sageの簡単な利用法</li>
</ul>
</div>
</li>

<li><a id="org6c5a855"></a><a href="https://www.pwv.co.jp/~take/TakeWiki/index.php?sage/sage%E3%81%AE%E7%B4%B9%E4%BB%8B%20">sage/sageの紹介 - PukiWiki</a><br /></li>
</ol>

<div id="outline-container-orga0eb54c" class="outline-4">
<h4 id="orga0eb54c"><span class="section-number-4">2.2.1</span> <a href="https://www.wolframalpha.com/">Wolfram|Alpha: Computational Knowledge Engine</a></h4>
</div>
</div>


<div id="outline-container-org66758bb" class="outline-3">
<h3 id="org66758bb"><span class="section-number-3">2.3</span> 数式処理アルゴリズム</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org9200873" class="outline-4">
<h4 id="org9200873"><span class="section-number-4">2.3.1</span> 奈良女子大で話した Groebner<sub>basis</sub> の話</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
<a href="file:///NFS/ufs/mac/masayuki/BSD/Cal/nara-wu/gbasis.tex">file:///NFS/ufs/mac/masayuki/BSD/Cal/nara-wu/gbasis.tex</a>
</p>
</div>
</div>

<div id="outline-container-org7672b6c" class="outline-4">
<h4 id="org7672b6c"><span class="section-number-4">2.3.2</span> 不定積分入門&#xa0;&#xa0;&#xa0;<span class="tag"><span class="algorithm">algorithm</span>&#xa0;<span class="risch">risch</span>&#xa0;<span class="integral">integral</span>&#xa0;<span class="math">math</span></span></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
<a href="https://www-sop.inria.fr/cafe/Manuel.Bronstein/publications/issac98.pdf">symbolic integration tutorial&#x2013;issac98.pdf</a>
</p>

<p>
wikipedia の参考文献にあった
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2017-10-03 火 16:54]</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-org7559aec" class="outline-3">
<h3 id="org7559aec"><span class="section-number-3">2.4</span> Web 進化論/知の構造化</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://wiki.cis.iwate-u.ac.jp/~suzuki/web_revolution/">https://wiki.cis.iwate-u.ac.jp/~suzuki/web_revolution/</a>
</p>
</div>
</div>

<div id="outline-container-orgfe22b69" class="outline-3">
<h3 id="orgfe22b69"><span class="section-number-3">2.5</span> 情報科学 の立場から</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orge27af26" class="outline-4">
<h4 id="orge27af26"><span class="section-number-4">2.5.1</span> 情報科学の本質 抽象化のための手続き</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
<a href="https://wiki.cis.iwate-u.ac.jp/~suzuki/lects/commons/abstraction.html">抽象化のための手続き</a>
</p>
</div>
</div>


<div id="outline-container-org07ccdf6" class="outline-4">
<h4 id="org07ccdf6"><span class="section-number-4">2.5.2</span> 情報科学のための数学</h4>
<div class="outline-text-4" id="text-2-5-2">
</div>
<ol class="org-ol">
<li><a id="org0171c3b"></a>プログラム可能な証明<br /></li>

<li><a id="org4006547"></a>機械証明 &#x2013; 証明から計算へ<br /></li>
</ol>
</div>

<div id="outline-container-org31973a7" class="outline-4">
<h4 id="org31973a7"><span class="section-number-4">2.5.3</span> 思考とメモと文書作成のためのデジタル・ツール</h4>
<div class="outline-text-4" id="text-2-5-3">
</div>
<ol class="org-ol">
<li><a id="org245334f"></a>MindMapping<br /></li>

<li><a id="org56797c4"></a>outliner<br />
<div class="outline-text-5" id="text-2-5-3-2">
<p>
<a href="./outline-reading-writing.html">./outline-reading-writing.html</a>
</p>
</div>

<ol class="org-ol">
<li><a id="org4df49e4"></a>emacs org - アウトライナー<br />
<ol class="org-ol">
<li><a id="orgadd5e10"></a>Org Babelで文芸的プログラミング · ops●tokyo<br />
<div class="outline-text-7" id="text-2-5-3-2-1-1">
<p>
<a href="https://wallyqs.github.io/posts/2014/12/12/using-org-babel-for-lp-jp/">Org Babelで文芸的プログラミング · ops●tokyo</a>
素晴しい!
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>

<li><a id="orgf97a848"></a>LaTeX tikz<br /></li>

<li><a id="org95b5819"></a>markup<br />
<div class="outline-text-5" id="text-2-5-3-4">
<ul class="org-ul">
<li>simplenote</li>
<li>Emacs org-mode</li>
</ul>
</div>
</li>

<li><a id="org4360ef4"></a>HyperLink<br />
<div class="outline-text-5" id="text-2-5-3-5">
<ul class="org-ul">
<li>HTML origin</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org781eed2" class="outline-2">
<h2 id="org781eed2"><span class="section-number-2">3</span> コンピュータと数式処理のリンク集</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org86dcffa" class="outline-3">
<h3 id="org86dcffa"><span class="section-number-3">3.1</span> sage</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://cocalc.com/projects?session=default">Projects - CoCalc</a>
</p>

<p>
<a href="https://sagecell.sagemath.org/">Sage Cell Server</a>
</p>

<ul class="org-ul">
<li><a href="https://doc.sagemath.org/pdf/ja/tutorial/tutorial-jp.pdf">Sage tutorial-jp.pdf</a></li>
</ul>

<p>
<a href="https://www.pwv.co.jp/~take/TakeWiki/index.php?sage/sage%E3%81%AE%E7%B4%B9%E4%BB%8B">sage/sageの紹介 - PukiWiki</a> たけもとさん
</p>

<ul class="org-ul">
<li><a href="https://www.pwv.co.jp/~take/TakeWiki/index.php?sage/%E8%A8%88%E7%AE%97%E3%81%97%E3%81%A6%E3%81%BF%E3%82%88%E3%81%86">sage/計算してみよう - PukiWiki</a></li>

<li><a href="https://www.pwv.co.jp/~take/TakeWiki/index.php?sage/Sage%E3%81%A7Octave%E3%82%92%E4%BD%BF%E3%81%86">sage/SageでOctaveを使う - PukiWiki</a></li>
</ul>
</div>
</div>

<div id="outline-container-org46ca4ba" class="outline-3">
<h3 id="org46ca4ba"><span class="section-number-3">3.2</span> SageLink</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://sagemath.org">https://sagemath.org</a> 
</p>

<p>
<a href="https://sk.sagepub.com/reference">SAGE Knowledge - Reference</a> reference の検索
</p>

<p>
<a href="https://qiita.com/HirofumiYashima/items/6bb5770961a3b7d33118">Sageに関するリンク集</a>
</p>

<p>
<a href="https://www.gregorybard.com/Sage.html">Sage for undergraduates, free pdf</a>   このページ内に pdf へのリンクが
ある
</p>
</div>
</div>
</div>

<div id="outline-container-org96c8d74" class="outline-2">
<h2 id="org96c8d74"><span class="section-number-2">4</span> 数式処理アルゴリズム</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8b07038" class="outline-4">
<h4 id="org8b07038"><span class="section-number-4">4.0.1</span> 不定積分入門&#xa0;&#xa0;&#xa0;<span class="tag"><span class="algorithm">algorithm</span>&#xa0;<span class="risch">risch</span>&#xa0;<span class="integral">integral</span>&#xa0;<span class="math">math</span></span></h4>
<div class="outline-text-4" id="text-4-0-1">
<p>
<a href="https://www-sop.inria.fr/cafe/Manuel.Bronstein/publications/issac98.pdf">symbolic integration tutorial&#x2013;issac98.pdf</a>
</p>
</div>
</div>

<div id="outline-container-orgc16ce31" class="outline-4">
<h4 id="orgc16ce31"><span class="section-number-4">4.0.2</span> Greobner基底に関するページ</h4>
<div class="outline-text-4" id="text-4-0-2">
<ul class="org-ul">
<li><a href="https://www.slideshare.net/konn/grbner">技術者が知るべき Gröbner 基底</a></li>

<li><a href="https://sssslide.com/speakerdeck.com/konn/wakatutatumorininaru-grobner-ji-di">わかったつもりになる Gröbner 基底 - SSSSLIDE</a></li>

<li><a href="https://konn-san.com/math/computational-algebra-seminar.html">計算機代数ゼミ発表資料 - konn-san.com</a></li>

<li><a href="https://github.com/konn/computational-algebra">konn/computational-algebra: Library to calculate Gröbner basis written in Haskell.</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaf91040" class="outline-2">
<h2 id="orgaf91040"><span class="section-number-2">5</span> Web 進化論/知の構造化</h2>
<div class="outline-text-2" id="text-5">
<p>
「知識」について考え直す時なのでは？
</p>
</div>

<ol class="org-ol">
<li><a id="org50d181b"></a><a href="https://ocw.u-tokyo.ac.jp/lecture_files/gf_18/1/notes/ja/01yoshimimima.pdf">今，学問，大学，知識，について，何が起っているのか？</a><br />
<div class="outline-text-5" id="text-5-0-0-1">
<ul class="org-ul">
<li>知の細分化と閉塞、全体を視る目の喪失</li>

<li>知識は「みんな」で作るものだという発想</li>

<li>構造性：要素を相互に結びつける構造こそ知識</li>

<li>ネット検索で瞬時にして必要な情報を次々に手に入れることで、緩やか
に形成される知識を失っているのかもしれない？</li>

<li>学術俯瞰とタテとヨコをつなぐ学び，
新しいリベラルアーツと専門知の結合</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: m</p>
<p class="date">Created: 2018-11-13 火 10:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
